[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:53:42
           id="requesterEmail"
           type="text"
           isInvalid={Boolean(errors.requesterEmail)}
-          {...register("requesterEmail", {
-            required: "RequesterEmail is required",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("requesterEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /RequesterEmail is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:92:23
           type="text"
           isInvalid={Boolean(errors.tableOrBreakoutRoom)}
           {...register("tableOrBreakoutRoom", {
-            required: "TableOrBreakoutRoom is required",
+            required: "",
           })}
         />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /TableOrBreakoutRoom is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.jsx:113:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.requestTime && "RequestTime is required"}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /RequestTime is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequests/HelpRequestForm.jsx:113:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.requestTime && "RequestTime is required"}
+          {errors.requestTime || "RequestTime is required"}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /RequesterEmail is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:124:39
           id="explanation"
           type="text"
           isInvalid={Boolean(errors.explanation)}
-          {...register("explanation", {
-            required: "Explanation is required",
-          })}
+          {...register("explanation", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Explanation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:141:23
           type="text"
           isInvalid={Boolean(errors.solved)}
           {...register("solved", {
-            required: "Solved is required",
+            required: "",
           })}
         />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Solved is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
