[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:49:20
     },
     {
       header: "TeamId",
-      accessorKey: "teamId",
+      accessorKey: "",
     },
     {
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-teamId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:52:15
       accessorKey: "teamId",
     },
     {
-      header: "Table or Breakout Room",
+      header: "",
       accessorKey: "tableOrBreakoutRoom",
     },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Table or Breakout Room. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"
