[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestsCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function HelpRequestsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestsCreatePage.jsx:11:13
   const objectToAxiosParams = (helpRequest) => ({
     url: "/api/helprequests/post",
     method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
+    params: {},
   });
 
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected {} to deeply equal { …(6) }
