[Killed] BooleanLiteral
main/pages/HelpRequest/HelpRequestsEditPage.jsx:8:60
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function HelpRequestsEditPage({ storybook = false }) {
+export default function HelpRequestsEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/helprequests' } ]

Number of calls: 0

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestsEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (helpRequest) => ({
-    url: "/api/helprequests",
+    url: "",
     method: "PUT",
     params: {
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Help Request Updated - id: 17 requesterEmail: cgaucho@ucsb.edu",

[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestsEditPage.jsx:34:11
     params: {
       id: helpRequest.id,
     },
-    data: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
+    data: {},
   });
 
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{}' to be '{"requesterEmail":"cgaucho@ucsb.edu",…' // Object.is equality

[Killed] LogicalOperator
main/pages/HelpRequest/HelpRequestsEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Help Request</h1>
-        {helpRequest && (
-          <HelpRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={helpRequest}
-          />
-        )}
+        {helpRequest || <HelpRequestForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={helpRequest} />}
       </div>
     </BasicLayout>
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
