[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestsIndexPage.jsx:30:27
         <Button
           variant="primary"
           href="/helprequests/create"
-          style={{ float: "right" }}
+          style={{ float: "" }}
         >
           Create Help Request
killedBy: HelpRequestsIndexPage tests Renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
