[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestsForm.jsx:20:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "RecommendationRequestsForm";
+  const testIdPrefix = "";
 
   // For explanation, see: https://stackoverflow.com/questions/3143070/javascript-regex-iso-datetime
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] StringLiteral
main/components/RecommendationRequests/RecommendationRequestsForm.jsx:69:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="professorEmail">Professor Email</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-professorEmail"}
+          data-testid={testIdPrefix + ""}
           id="professorEmail"
           type="email"

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestsForm.jsx:90:23
           type="text"
           isInvalid={Boolean(errors.explanation)}
           {...register("explanation", {
-            required: "Explanation is required.",
+            required: "",
           })}
         />
killedBy: RecommendationRequestsForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Explanation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequests/RecommendationRequestsForm.jsx:113:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateRequested && "Date Requested is required. "}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestsForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Requested is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequests/RecommendationRequestsForm.jsx:130:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateNeeded && "Date Needed is required. "}
+          {errors.dateNeeded || "Date Needed is required. "}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestsForm tests renders correctly with no initialContents
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Date Needed is required. 
</div> instead
