[Killed] BlockStatement
main/components/RecommendationRequests/RecommendationRequestsTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/recommendationRequests/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: RecommendationRequestsTable tests Edit button navigates to the edit page
statusReason: expected "vi.fn()" to be called with arguments: [ '/recommendationRequests/edit/2' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestsTable.jsx:45:20
 
     {
       header: "Requester Email",
-      accessorKey: "requesterEmail",
+      accessorKey: "",
     },
     {
killedBy: RecommendationRequestsTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestsTable"

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestsTable.jsx:59:5
       header: "Date Requested(iso format)",
       accessorKey: "dateRequested",
     },
-    {
-      header: "Date Needed(iso format)",
-      accessorKey: "dateNeeded",
-    },
+    {},
     {
       header: "Done",
killedBy: RecommendationRequestsTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
