[Killed] BooleanLiteral
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:8:15
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestsCreatePage({
-  storybook = false,
+  storybook = true,
 }) {
   const objectToAxiosParams = (recommendationRequest) => ({
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/recommendationrequests' } ]

Number of calls: 0

[Killed] ArrowFunction
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:10:31
 export default function RecommendationRequestsCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:10:59
 export default function RecommendationRequestsCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = (recommendationRequest) => ({});
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:11:10
   storybook = false,
 }) {
   const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequests/post",
+    url: "",
     method: "POST",
     params: {
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New recommendationRequest Created - id: 2 requesterEmail: dongyi_xia@uscb.edu",

[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:13:13
   const objectToAxiosParams = (recommendationRequest) => ({
     url: "/api/recommendationrequests/post",
     method: "POST",
-    params: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
+    params: {},
   });
 
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected {} to deeply equal { …(6) }

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:23:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `New recommendationRequest Created - id: ${recommendationRequest.id} requesterEmail: ${recommendationRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:42:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/recommendationrequests" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/recommendationrequests' } ]

Number of calls: 0
