[Killed] BooleanLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:8:70
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function RecommendationRequestsEditPage({ storybook = false }) {
+export default function RecommendationRequestsEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/recommendationrequests' } ]

Number of calls: 0

[Killed] ArrowFunction
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequests",
-    method: "PUT",
-    params: {
-      id: recommendationRequest.id,
-    },
-    data: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Recommendation Request Updated - id: 2 requesterEmail: dongyi_xia_updated@ucsb.edu",

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequests",
+    url: "",
     method: "PUT",
     params: {
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Recommendation Request Updated - id: 2 requesterEmail: dongyi_xia_updated@ucsb.edu",

[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:31:13
   const objectToAxiosPutParams = (recommendationRequest) => ({
     url: "/api/recommendationrequests",
     method: "PUT",
-    params: {
-      id: recommendationRequest.id,
-    },
+    params: {},
     data: {
       requesterEmail: recommendationRequest.requesterEmail,
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected {} to deeply equal { id: 2 }

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:44:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `Recommendation Request Updated - id: ${recommendationRequest.id} requesterEmail: ${recommendationRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:46:7
 
   const onSuccess = (recommendationRequest) => {
     toast(
-      `Recommendation Request Updated - id: ${recommendationRequest.id} requesterEmail: ${recommendationRequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Recommendation Request Updated - id: 2 requesterEmail: dongyi_xia_updated@ucsb.edu",

[Killed] ConditionalExpression
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationRequest && (
-          <RecommendationRequestsForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationRequest}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationRequest && (
-          <RecommendationRequestsForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationRequest}
-          />
-        )}
+        {recommendationRequest || <RecommendationRequestsForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={recommendationRequest} />}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
