[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsIndexPage.jsx:19:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/recommendationrequests/all"],
-    { method: "GET", url: "/api/recommendationrequests/all" },
+    { method: "", url: "/api/recommendationrequests/all" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: RecommendationRequestsIndexPage tests renders empty table when backend unavailable, user only
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsIndexPage.jsx:19:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/recommendationrequests/all"],
-    { method: "GET", url: "/api/recommendationrequests/all" },
+    { method: "GET", url: "" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: RecommendationRequestsIndexPage tests renders three recommendation requests correctly for regular user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsIndexPage.jsx:24:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/recommendationrequests/create"
-          style={{ float: "right" }}
-        >
-          Create Recommendation Request
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: RecommendationRequestsIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Recommendation Request/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsIndexPage.jsx:25:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/recommendationrequests/create"
-          style={{ float: "right" }}
-        >
-          Create Recommendation Request
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: RecommendationRequestsIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Recommendation Request/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
