[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewTable.jsx:48:20
     },
     {
       header: "ReviewerEmail",
-      accessorKey: "reviewerEmail",
+      accessorKey: "",
     },
     {
killedBy: MenuItemReviewTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-reviewerEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"
