[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuItemReview) => ({
-    url: "/api/menuitemreview/post",
-    method: "POST",
-    params: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      comments: menuItemReview.comments,
-      dateReviewed: menuItemReview.dateReviewed,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuItemReview
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
