[Killed] StringLiteral
main/components/Articles/ArticleTable.jsx:60:15
       accessorKey: "email",
     },
     {
-      header: "Date Added(iso format)",
+      header: "",
       accessorKey: "dateAdded",
     },
killedBy: ArticleTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Date Added(iso format). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticleTable"
