[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:24:10
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
         {/* if there are initial contents, then show the id as read-only */}
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDiningCommonsMenuItem-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="UCSBDiningCommonsMenuItem-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:24:10
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
         {/* if there are initial contents, then show the id as read-only */}
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDiningCommonsMenuItem-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly when passing in a UCSBDiningCommonsMenuItem
statusReason: Unable to find an element by: [data-testid="/UCSBDiningCommonsMenuItem-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:52:27
               isInvalid={Boolean(errors.diningCommonsCode)}
               {...register("diningCommonsCode", {
                 required: true,
-                validate: (v) =>
-                  ["portola", "ortega", "carillo", "dlg"].includes(v) ||
-                  "Must be one of: portola, ortega, carillo, dlg",
+                validate: () => undefined,
               })}
             />
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Must be one of: portola, ortega, carillo, dlg/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:53:19
               {...register("diningCommonsCode", {
                 required: true,
                 validate: (v) =>
-                  ["portola", "ortega", "carillo", "dlg"].includes(v) ||
-                  "Must be one of: portola, ortega, carillo, dlg",
+                  true,
               })}
             />
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Must be one of: portola, ortega, carillo, dlg/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:53:19
               {...register("diningCommonsCode", {
                 required: true,
                 validate: (v) =>
-                  ["portola", "ortega", "carillo", "dlg"].includes(v) ||
-                  "Must be one of: portola, ortega, carillo, dlg",
+                  ["portola", "ortega", "carillo", "dlg"].includes(v) && "Must be one of: portola, ortega, carillo, dlg",
               })}
             />
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Must be one of: portola, ortega, carillo, dlg/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:58:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.diningCommonsCode?.message ||
+              {errors.diningCommonsCode.message ||
                 (errors.diningCommonsCode && "Dining Commons Code is required")}
             </Form.Control.Feedback>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:58:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.diningCommonsCode?.message ||
-                (errors.diningCommonsCode && "Dining Commons Code is required")}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Must be one of: portola, ortega, carillo, dlg/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:59:18
             />
             <Form.Control.Feedback type="invalid">
               {errors.diningCommonsCode?.message ||
-                (errors.diningCommonsCode && "Dining Commons Code is required")}
+                (false)}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Dining Commons Code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:59:18
             />
             <Form.Control.Feedback type="invalid">
               {errors.diningCommonsCode?.message ||
-                (errors.diningCommonsCode && "Dining Commons Code is required")}
+                (errors.diningCommonsCode || "Dining Commons Code is required")}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly
statusReason: Found multiple elements with the text: /Dining Commons Code/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="diningCommonsCode"
